# DoubleArray Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DoubleArray Class
Members See Also
---
An array that contains doubles.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DoubleArray : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class DoubleArray _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class DoubleArray : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..DoubleArray
# See Also
DoubleArray Members
Autodesk.Revit.DB Namespace